import { useHistory } from "react-router-dom";
import "../../assets/css/EULA.css";

function EULA() {
  const history = useHistory();
  return (
    <div className="eula-container">
      <button className="back-button" onClick={() => history.goBack()}>
        {"←"} Назад
      </button>
      <h3 className="eula-title">Условия за NutriFit</h3>
      <p className="eula-date">
        Последна актуализация <span className="highlight">18/10/2024</span>
      </p>
      <p className="eula-intro">
        NutriFit е лицензирано на Вас (Краен потребител) за ползване само в
        съответствие с условията на това Споразумение за лиценз.
      </p>
      <p className="eula-intro">
        Чрез достъпа до уеб приложението NutriFit, Вие потвърждавате, че сте
        съгласни да бъдете обвързани от всички условия и разпоредби на това
        Споразумение за лиценз и че приемате това Споразумение за лиценз.
      </p>
      <p className="eula-intro">
        Лицензодателят е единствено отговорен за уеб приложението NutriFit и
        съдържанието му.
      </p>
      <p className="eula-intro">
        NutriFit е уеб приложение, което позволява на потребителите да въвеждат
        лична информация, за да получават информация за състоянието на тялото
        си.
      </p>

      <div className="eula-section">
        <strong>1. ОБХВАТ НА ЛИЦЕНЗА</strong>
        <p>
          1.1 Вие получавате непрехвърляем, неконкурентен, несублицензируем
          лиценз да използвате уеб приложението NutriFit за лична, некомерциална
          употреба.
        </p>
        <p>
          1.2 Вие не можете да споделяте или да правите уеб приложението
          достъпно за трети страни, да продавате, наемате, заемате, давате под
          наем или по друг начин да разпределяте уеб приложението.
        </p>
        <p>
          1.3 Вие не можете да извършвате обратен инженеринг, декомпилиране или
          да се опитвате да произвеждате изходния код на уеб приложението или
          неговата част.
        </p>
      </div>
      <div className="eula-section">
        <strong>2. ПОВЕРИТЕЛНОСТ И СИГУРНОСТ НА ДАННИТЕ</strong>
        <p>
          2.1 NutriFit събира и съхранява лични данни, включително възраст,
          тегло, височина, обиколка на врата, талията и ханша. Тези данни се
          използват за осигуряване на персонализирани здравни препоръки и за
          изчисляване и предоставяне на информация на потребителите като Индекс
          на Телесната Маса (ИТМ), Перфектно Тегло и други показатели за
          състоянието на тялото им.
        </p>
        <p>
          2.2 Личните данни, събрани чрез NutriFit, включително възраст, тегло,
          височина, обиколки на шията, талията и ханша, се използват единствено
          с цел предоставяне на персонализирани услуги в приложението. Тази
          информация ще бъде показвана само на Вас под формата на
          персонализирани графики, анализи и препоръки, свързани с Вашите
          физически показатели. Могат да бъдат използвани анонимизирани данни,
          като тегло, за генериране на статистики, включително средни стойности
          на тегло, които са достъпни за всички потребители на платформата. Тези
          статистики са извлечени от анонимизирани данни и не съдържат никаква
          лична информация, която би могла да бъде използвана за идентифициране
          на отделни потребители.
        </p>
        <p>
          2.3 NutriFit предприема подходящи мерки за защита на личните данни от
          неоторизиран достъп, промяна, разкриване или унищожаване. Личните
          данни се изпращат през сигурна връзка (HTTPS) към нашето API и се
          съхраняват в базата данни Firestore, която използва криптиране на
          данните както по време на предаване, така и при съхранение. Освен
          това, достъпът до данните е защитен чрез контрол на достъпа на базата
          на ролите, предоставени от Firestore.
        </p>
        <p>
          2.4 Потребителите имат право да поискат достъп до, коригиране или
          изтриване на техните лични данни, както и да оттеглят съгласието си за
          събиране на данни по всяко време, като се свържат с нас на{" "}
          <span className="highlight">nutrifit186@gmail.com</span>.
        </p>
      </div>

      <div className="eula-section">
        <strong>3. ОГРАНИЧЕНИЕ НА ОТГОВОРНОСТТА</strong>
        <p>
          3.1 До максималната степен, разрешена от приложимото право,
          Лицензодателят не носи отговорност за никакви специални, инцидентни,
          индиректни или последващи щети, произтичащи от или свързани с
          употребата или невъзможността за употреба на уеб приложението
          NutriFit.
        </p>
      </div>

      <div className="eula-section">
        <strong>4. ПРИЛОЖИМО ПРАВО</strong>
        <p>
          4.1 Това Споразумение за лиценз е регулирано и тълкувано в
          съответствие с законите на България, без да се вземат предвид
          принципите на конфликт на закони.
        </p>
      </div>

      <div className="eula-section">
        <strong>5. МОДИФИКАЦИИ НА СПОРАЗУМЕНИЕТО</strong>
        <p>
          5.1 Лицензодателят си запазва правото да изменя или актуализира
          условията на това Споразумение за лиценз по всяко време. Всички
          изменения ще влязат в сила незабавно след публикуването им в уеб
          приложението NutriFit.
        </p>
        <p>
          5.2 В случай на значителни промени, Лицензодателят ще уведоми
          потребителите.
        </p>
        <p>
          5.3 Продължаващото използване на уеб приложението NutriFit след такива
          изменения ще се счита за приемане на новите условия на Споразумението
          за лиценз.
        </p>
      </div>

      <div className="eula-section">
        <strong>6. ИНФОРМАЦИЯ ЗА КОНТАКТ</strong>
        <p>
          6.1 За всякакви въпроси относно това Споразумение за лиценз, моля,
          свържете се с Лицензодателя на{" "}
          <span className="highlight">nutrifit186@gmail.com</span> или посетете{" "}
          <a
            href="https://nutri.noit.eu/#/admin/contact"
            className="contact-link"
          >
            страницата за контакт
          </a>
          .
        </p>
      </div>
    </div>
  );
}

export default EULA;
